#include "iostream.h"
void main()
{
    int a,b,c;    //定义变量
    a=60;         //60的二进制:0011 1100
    b=15;         //30的二进制:0000 1111
    c=0;
    
    c=a&b;                      
    cout<<"a&b = "<<c<<"\n";    
                                   /*
                                              &的运算规则:
                                              0 & 0 = 0 ;   
                                              0 & 1 = 0 ;    
                                              1 & 0 = 0 ;     
                                              1 & 1 = 1 ;
                                              (A&B)=00001100(2)=12(10)
                                   */
    c=a|b;
    cout<<"a|b = "<<c<<"\n";
    
                                    /*
                                              |的运算规则:
                                              0 & 0 = 0 ;   
                                              0 & 1 = 1 ;    
                                              1 & 0 = 1 ;     
                                              1 & 1 = 1 ;
                                              (A&B)=00111111(2)=63(10)
                                   */
    
    c=a^b;
    cout<<"a^b = "<<c<<"\n";
    
                                    /*
                                              ^的运算规则:
                                              0 & 0 = 0 ;   
                                              0 & 1 = 1 ;    
                                              1 & 0 = 1 ;     
                                              1 & 1 = 0 ;
                                              (A&B)=00110011(2)=51(10)
                                   */
    
    c=a<<2;
    cout<<"a<<2 = "<<c<<"\n";
    
                                    /*
                                              <<的运算规则:
                                              将一个运算对象的各二进制位全部左移若干位(左边的二进制位丢弃，右边补0)
                                   */
    
    c=a>>2;
    cout<<"a>>2 = "<<c<<"\n";
                                  /*
                                               将一个运算对象的各二进制位全部左移若干位（左边的二进制位丢弃，右边补0
                                  */
}
